app/views/teams/_navbarindex.html.erb

SELECT "teams".* FROM "teams" WHERE (name LIKE '%%') ORDER BY created_at DESC
SELECT COUNT(*) FROM "teams"
---

        <% if @teams.blank? && Team.count != 0 %>

SELECT COUNT(*) FROM "teams"
---
        <% end %>
        <% if Team.count == 0 %>