app/views/teams/index.html.erb

            <td class="nontextfield indexborders"><%= team.date_of_founding.strftime("%d.%m.%Y") %></td>
            <td class="nontextfield indexborders"><%= team.players.count %></td>
---
SELECT COUNT(*) FROM "players" WHERE "players"."team_id" = ?  [["team_id", 9]]