app/views/teams/show.html.erb


    <% if @team.players.count > 0 %>
---
SELECT "players".* FROM "players" WHERE "players"."team_id" = ?  [["team_id", 3]]
SELECT COUNT(*) FROM "players" WHERE "players"."team_id" = ?  [["team_id", 4]]

      <ul class="list-group">
      <% @team.players.each do |player| %>
---
SELECT "players".* FROM "players" WHERE "players"."team_id" = ?  [["team_id", 4]]