app/views/players/_navbarindex.html.erb

SELECT "players".* FROM "players" WHERE (name LIKE '%dsfdf%') ORDER BY created_at DESC
SELECT COUNT(*) FROM "players"
---

        <% if @players.blank? && Player.count != 0 %>

SELECT "players".* FROM "players" ORDER BY name asc
SELECT COUNT(*) FROM "players"
---
        <% end %>
        <% if Player.count == 0 %>