app/views/players/index.html.erb

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
            <td class="textfield indexborders">
                <% if player.team.present? %>