app/views/players/show.html.erb

      <strong>Team:</strong>
      <% if @player.team.present? %>
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]