app/controllers/players_controller.rb

  def index
    @players = Player.all
---
SELECT "players".* FROM "players" WHERE (name LIKE '%daw%') ORDER BY created_at DESC

  def new
    @player = Player.new
    @teams = Team.all.order(:name)
---
SELECT "teams".* FROM "teams" ORDER BY "teams"."name" ASC

  def edit
    @teams = Team.all.order(:name)
---
SELECT "teams".* FROM "teams" ORDER BY "teams"."name" ASC

  def create
    @player = Player.new(player_params)
    @teams = Team.all.order(:name)

    if @player.save
---
SELECT "teams".* FROM "teams" ORDER BY "teams"."name" ASC
INSERT INTO "players" ("name", "surname", "nickname", "salary", "date_of_birth", "created_at", "updated_at", "team_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @teams = Team.all.order(:name)
    if @player.update(player_params)
---
SELECT "teams".* FROM "teams" ORDER BY "teams"."name" ASC
UPDATE "players" SET "date_of_birth" = ?, "updated_at" = ? WHERE "players"."id" = ?  [["date_of_birth", "1999-03-06"], ["updated_at", "2018-03-06 14:49:34.668658"], ["id", 1]]

  def destroy
    @player.destroy
---
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 2]]