app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams" WHERE (name LIKE '%eetest%') ORDER BY created_at DESC
---
  def index
    @teams = Team.all

INSERT INTO "teams" ("name", "date_of_founding", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Virtus.pro"], ["date_of_founding", "2009-02-04"], ["created_at", "2018-03-06 11:05:52.900372"], ["updated_at", "2018-03-06 11:05:52.900372"]]
---
  def create
    @team = Team.new(team_params)

    if @team.save

UPDATE "teams" SET "name" = ?, "updated_at" = ? WHERE "teams"."id" = ?  [["name", "Virtus.proo"], ["updated_at", "2018-03-06 11:06:56.679504"], ["id", 2]]
---
  def update
    if @team.update(team_params)

DELETE FROM "matches" WHERE "matches"."id" = ?  [["id", 12]]
DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 1]]
SELECT "matches".* FROM "matches" WHERE "matches"."team_one_id" = ?  [["team_one_id", 5]]
DELETE FROM "matches" WHERE "matches"."id" = ?  [["id", 9]]
SELECT "matches".* FROM "matches" WHERE "matches"."team_two_id" = ?  [["team_two_id", 5]]
DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 5]]
---
  def destroy #wraz z usunieciem druzyny usuwamy jej historie meczy
    Match.where(:team_one_id => @team.id).destroy_all
    Match.where(:team_two_id => @team.id).destroy_all
    @team.destroy