app/models/player.rb

  def nickname_unique?
    if Player.where.not(id: self.id).exists?(:nickname=>self.nickname)
---
SELECT  1 AS one FROM "players" WHERE "players"."id" != ? AND "players"."nickname" = ? LIMIT ?  [["id", 1], ["nickname", "Jakis"], ["LIMIT", 1]]