app/models/team.rb

SELECT  1 AS one FROM "teams" WHERE "teams"."id" != ? AND "teams"."name" = ? LIMIT ?  [["id", 1], ["name", "Virtus.pro"], ["LIMIT", 1]]
---
  def team_name_unique?
    if Team.where.not(id: self.id).exists?(:name=>self.name)